OpenFOAM/1_HeleShawRT/sims/n13sat/flow/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       dictionary;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 2 -2 0 0 0 0];

internalField uniform 0;

boundaryField
{

  #includeEtc "caseDicts/setConstraintTypes"
    
  wallFluidSolid
  {
    type zeroGradient;
  }

  wallFluidFluid
  {
    type zeroGradient;
  }

  outlet
  {
    type fixedFluxPressure;
  }

  inlet
  {
    type fixedValue;
    value uniform 0;
  }

  "(front|back)"
  {
    type zeroGradient;
  }

  "(top|bottom)"
  {
    type empty;
  }
}

