OpenFOAM/1_HeleShawRT/sims/n13sat/flow/system/sets
sets
{
type sets;
libs ("libsampling.so");
setFormat csv;
fields (p);                     
interpolationScheme cellPoint;
sets
{
mySet
{
type cloud;
axis xyz;
points
(
(3.066659e-05 0.052325 0)
(3.066659e-05 0.052340333 0)
(3.066659e-05 0.052355667 0)
(3.066659e-05 0.052371 0)
(3.066659e-05 0.052386333 0)
(3.066659e-05 0.052401667 0)
(3.066659e-05 0.052417 0)
(3.066659e-05 0.052432333 0)
(3.066659e-05 0.052447667 0)
(3.066659e-05 0.052463 0)
(3.066659e-05 0.052478333 0)
(3.066659e-05 0.052493667 0)
(3.066659e-05 0.052509 0)
(3.066659e-05 0.052524333 0)
(3.066659e-05 0.052539667 0)
(3.066659e-05 0.052555 0)
(3.066659e-05 0.052570333 0)
(3.066659e-05 0.052585667 0)
(3.066659e-05 0.052601 0)
(3.066659e-05 0.052616333 0)
(3.066659e-05 0.052631667 0)
(3.066659e-05 0.052647 0)
(3.066659e-05 0.052662333 0)
(3.066659e-05 0.052677667 0)
(3.066659e-05 0.052693 0)
(3.066659e-05 0.052708333 0)
(3.066659e-05 0.052723667 0)
(3.066659e-05 0.052739 0)
(3.066659e-05 0.052754333 0)
(3.066659e-05 0.052769667 0)
(3.066659e-05 0.052785 0)
(3.066659e-05 0.052800333 0)
(3.066659e-05 0.052815667 0)
(3.066659e-05 0.052831001 0)
(3.066659e-05 0.052846336 0)
(3.066659e-05 0.052861674 0)
(3.066659e-05 0.052877017 0)
(3.066659e-05 0.05289237 0)
(3.066659e-05 0.052907733 0)
(3.066659e-05 0.052923108 0)
(3.066659e-05 0.052938508 0)
(3.066659e-05 0.052953969 0)
(3.066659e-05 0.052969599 0)
(3.066659e-05 0.052983995 0)
(3.066659e-05 0.031348307 0)
(3.066659e-05 0.03136264 0)
(3.066659e-05 0.03137783 0)
(3.066659e-05 0.0313935 0)
(3.066659e-05 0.031409335 0)
(3.066659e-05 0.031425099 0)
(3.066659e-05 0.031440718 0)
(3.066659e-05 0.031456211 0)
(3.066659e-05 0.03147162 0)
(3.066659e-05 0.031486984 0)
(3.066659e-05 0.031502328 0)
(3.066659e-05 0.031517665 0)
(3.066659e-05 0.031532999 0)
(3.066659e-05 0.031548333 0)
(3.066659e-05 0.031563667 0)
(3.066659e-05 0.031579 0)
(3.066659e-05 0.031594333 0)
(3.066659e-05 0.031609667 0)
(3.066659e-05 0.031625 0)
(3.066659e-05 0.031640333 0)
(3.066659e-05 0.031655667 0)
(3.066659e-05 0.031671 0)
(3.066659e-05 0.031686333 0)
(3.066659e-05 0.031701667 0)
(3.066659e-05 0.031717 0)
(3.066659e-05 0.031732333 0)
(3.066659e-05 0.031747668 0)
(3.066659e-05 0.031763006 0)
(3.066659e-05 0.031778349 0)
(3.066659e-05 0.031793707 0)
(3.066659e-05 0.031809092 0)
(3.066659e-05 0.031824517 0)
(3.066659e-05 0.031839983 0)
(3.066659e-05 0.031855461 0)
(3.066659e-05 0.03187088 0)
(3.066659e-05 0.031885987 0)
(3.066659e-05 0.033158013 0)
(3.066659e-05 0.03317312 0)
(3.066659e-05 0.033188539 0)
(3.066659e-05 0.033204017 0)
(3.066659e-05 0.033219483 0)
(3.066659e-05 0.033234908 0)
(3.066659e-05 0.033250293 0)
(3.066659e-05 0.033265651 0)
(3.066659e-05 0.033280994 0)
(3.066659e-05 0.033296332 0)
(3.066659e-05 0.033311667 0)
(3.066659e-05 0.033327 0)
(3.066659e-05 0.033342333 0)
(3.066659e-05 0.033357667 0)
(3.066659e-05 0.033373 0)
(3.066659e-05 0.033388333 0)
(3.066659e-05 0.033403667 0)
(3.066659e-05 0.033419 0)
(3.066659e-05 0.033434333 0)
...
);
}
}
}